# Штрафи для обчислення функцій пристосованості
# --------------------------------------------------
# f1: STUDENT
P_STUDENT_GAP = 500                 # HC3 - Штраф за вікно в учнівському розкладі
P_UNWANTED_SLOT = 50                # SC1 - Штраф за використання W-слота
P_UNPLACED_LESSON = 10000           # HC2 - Штраф за втрачений урок

# f2: DIDACTIC
P_SUBJECT_MISMATCH = 100            # SC2 - Штраф за планування дистанційного уроку
                                    #       з предмета, пріоритетного для очного уроку
P_DIFFICULTY_DISTRIBUTION = 20      # SC3 - Штраф за порушення кривої складності
P_STACK_VIOLATION = 50              # SC4 - Штраф за перевищення ліміту уроків
                                    #       з даного предмету поспіль
P_STACK_NON_PREFERRED = 10          # SC4 - Штраф за невідповідність бажаному
                                    #       числа уроків з даного предмету поспіль
P_MAX_LESSONS_PER_DAY = 200         # SC5 - Штраф за перевищення ліміту уроків
                                    #       з даного предмету на день

# f3: TEACHER
P_TEACHER_GAP = 20                  # SC6 - Штраф за вікно у вчителя
P_EXCESS_ONLINE_FROM_SCHOOL = 100   # SC8 - Штраф за перевищення ліміту онлайн уроків,
                                    #       проведених з приміщення ПШ


# Параметри генетичного алгоритму
# --------------------------------------------------

POPULATION_SIZE = 150                # Розмір популяції
GENERATIONS = 100                   # Кількість поколінь
CXPB = 0.7                          # Ймовірність схрещування
MUTPB = 0.1                         # Ймовірність мутації
INDPB = 0.05                        # Ймовірність перестановки окремого гена при мутації